app/views/comments/restaurant_comments.html.erb


<h1><%= @comments.first.restaurant.title %> Comments</h1>
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]