app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @comment.restaurant = Restaurant.find(params[:restaurant])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("title", "text", "score", "user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "xd"], ["text", "xd"], ["score", 10.0], ["user_id", 1], ["restaurant_id", 1], ["created_at", "2019-01-23 21:35:24.515474"], ["updated_at", "2019-01-23 21:35:24.515474"]]

  def restaurant_comments
    restaurant = Restaurant.find(params[:comment_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def user_comments
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]