app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" ORDER BY "restaurants"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."title" = ? LIMIT ?  [["title", "mofitex's pizzas"], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."restaurant_id" = ? ORDER BY "comments"."score" DESC  [["restaurant_id", 1]]
SELECT AVG("comments"."score") FROM "comments" WHERE "comments"."restaurant_id" = 1
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @hash = {}
    @buscar = params[:buscar]
    if @buscar==""
      @restaurants = Restaurant.all
    elsif @buscar
      @restaurants = Restaurant.where("title LIKE ?", "%#{@buscar}%")
    else
      @restaurants = Restaurant.all
      @restaurants.each do |item|
        @number = Comment.where(restaurant: item).average(:score)
        @hash[item.id] = @number
      end
      Hash[@hash.sort_by{|k, v| v}.reverse]
      @restaurants = []
      @hash.each_with_index do |val,index|
        flash[:success] = "#{@hash.values[0]}, #{@hash.values[1]}, #{@hash.values[2]}"
        @id = @hash.keys[index]
        @restaurant = Restaurant.find(@id)

INSERT INTO "restaurants" ("title", "description", "user_id", "address", "telephone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

UPDATE "restaurants" SET "description" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["description", "xd"], ["updated_at", "2019-01-23 15:27:11.602565"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."user_id" = 3
---
  def user_restaurants
    @restaurants = Restaurant.where(user: (User.find_by id: current_user.id))