app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.admin
    else
      @user.admin = false
    end
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "password", "username", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "asdf@gmail.com"], ["password", "asdf"], ["username", "asdf"], ["admin", "f"], ["created_at", "2019-01-22 18:46:53.478805"], ["updated_at", "2019-01-22 18:46:53.478805"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "asz"], ["updated_at", "2019-01-23 16:14:01.172238"], ["id", 6]]

  def profile
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]